0.1.0/tutorials/incompressible/piso/les/motor_bike/motor_bike/0.org/include/frontBackUpperPatches
upperWall
{
  type symmetryPlane;
}

"(front|back)"
{
  type symmetryPlane;
}
