0.1.0/tutorials/incompressible/piso/les/motor_bike/motor_bike/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.24;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform 0.24;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform 0.24;
    value           uniform 0.24;
  }
  lowerWall
  {
    type            kqRWallFunction;
    value           uniform 0.24;
  }
  "motorBike_.*"
  {
    type            kqRWallFunction;
    value           uniform 0.24;
  }
  upperWall
  {
    type            symmetryPlane;
  }
  "(front|back)"
  {
    type            symmetryPlane;
  }
  "proc.*"
  {
    type            processor;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
