0.1.0/tutorials/incompressible/piso/les/motor_bike/motor_bike/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-07;
    relTol          0.1;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration on;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels     1;
  }
  pFinal
  {
    $p;
    tolerance       1e-6;
    relTol          0;
  };
  Phi
  {
    $p;
  }
  "(U|nuTilda)"
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    tolerance       1e-08;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
}
potentialFlow
{
  nNonOrthogonalCorrectors 10;
}
relaxationFactors
{
  p               0.3;
  U               0.5;
  nuTilda         0.5;
}
cache
{
  grad(U);
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
